[{"description": "Meet a miracle farmer Revathi with whom Association for India's Development (AID) has been working to reclaim agricultural lands affected by natural disasters. \n\nRevathi and her group, Inspire, have touched over 1 Million farmer lives, helped coordinate 22 disaster recovery efforts, facilitated the construction of 1800 ponds and restored hundreds of traditional seed varieties. Her work's been recognized by the governments of India, Sri Lanka and Indonesia.\n\nLearn about organic food and agriculture and listen to her incredible story.\n\nLearn how your support can make a difference.\n\nJoin Association for India’s Development at Berkeley and Indian Graduate Student Association Berkeley for an exciting, informative and interactive community event.", "end_time": "2016-11-02T19:00:00-0700", "name": "Meet a Miracle Farmer", "place": {"name": "3107 Etcheverry Hall, 2521 Hearst Ave, Berkeley"}, "start_time": "2016-11-02T17:30:00-0700", "id": "1635269490105508"}, {"name": "AID Berkeley 1st General Meeting", "start_time": "2016-10-21T18:00:00-0700", "id": "1787682038143627"}, {"description": "A screening of excerpts of India Untouched, a documentary about the pervasiveness of caste in the South Asian mindset, across socio-political lines. This will be followed by a Panel discussion on Caste in contemporary South Asia, as well as it's forms in the Diaspora, with an emphasis on the role of Identity amongst the Dalit Community.\n\nSponsors: ASATA, AID (Berkeley and Bay Area Chapters)\n\nWhen: December 4th, 2013; 6:30 P.M.\n\nWhere: East Bay (TBD)\n\nPanelists: \nT. Sound: Aligning with scholars who have compared untouchability in India with racism in the US, T. Sound, a second generation Indian American, speaks of Black Indians and invisible communities. She has addressed the politics of Indian identities in America, the presence (and widespread denial) of caste consciousness and prejudice, and the often unrecognized contributions of Dalits to debates such as the 2005 controversy over representation of Hinduism in California school textbooks. T. Sound has taken up a a traditional Dalit vocation of singing and storytelling. A performer, filmmaker, and transmedia artist, she will include song and story in her presentation. She has visited India extensively to research and raise awareness about Dalit exclusion and discrimination in India and diaspora;\n\nHarish Wankhede: Currently working as a Visiting Scholar at the Center for South Asia, Stanford University, his academic research is to see the interconnections between socio-religious identities (Dalit, Adivasis and Muslims), democracy and Institutional policies. Harish’s doctoral thesis is on ‘Secularism and Social Justice: Religious Minorities and Pursuit of Equality’, awarded by the Center for Political Studies, Jawaharlal Nehru University, New Delhi; Harish teaches Political Science at the Ram Lal Anand College of the Delhi University. For the last 5 years, he has contributed research articles and journalistic essays in some of the major periodicals, magazines and newspapers in India", "end_time": "2013-12-04T21:00:00-0800", "name": "Living in Caste: Identity as Resistance", "place": {"name": "Cory Hall, Room 521, UC Berkeley"}, "start_time": "2013-12-04T18:30:00-0800", "id": "616376051737635"}, {"description": "THE EVENT HAS FILLED UP AND WE ARE NOT TAKING ANY MORE RSVPs. THANKS FOR YOUR INTEREST. Dr. Ilina Sen is talking at another event in Stanford on April 29th - here are the details for that  talk:\nhttp://ica.stanford.edu/events/women-and-democratic-movements-india-changing-dynamics-altered-perspectives-lecture-ilina-sen\n\nGENDER, DEVELOPMENT AND STATE VIOLENCE IN ADIVASI INDIA: A special lecture by Dr. Ilina Sen \n\nDr. Ilina Sen is Professor of Women’s Studies at the Tata Institute of Social Sciences in India. For over three decades, Dr. Ilina Sen has been associated with numerous civil society and women’s movements in India. She co-founded Rupantar, a civil society group in the Indian state of Chhattisgarh in 1994 along with her husband, Dr. Binayak Sen, to promote indigenous (adivasi) knowledge, health, education and conserve biodiversity. The NGO undertakes programs such as, a village clinic in a malaria endemic area, an agricultural program focused on organic farming and preservation of indigenous biodiversity, program on food security and distribution systems, and several women’s empowerment initiatives, including providing resources for victims of domestic violence. She has authored several books on marginalized communities and the women’s movement in India - \"A Space within the Struggle: Women's Participation in people's Struggles\", \"The migrant women of Chhattisgarh\", \"The Women's Movement in India\". Together, both Ilina and Binayak have worked for more than three decades among some of India’s most impoverished and socially stigmatized populations (miners, peasants and India’s indigenous groups) on issues of health, livelihood and civil liberties.\n\nVenue: \nSuite 460 (4th Floor), David Brower Center\n2150 Allston Way, Berkeley\n\nThe event is free and open to public. Please call 510 545 2727 to enter the David Brower Center after 6 pm\nFor more information, check out http://www.womensearthalliance.org/, http://berkeley.aidindia.org/ and http://southasia.berkeley.edu/", "name": "Dr. Ilina Sen: Gender, Development and State Violence in Adivasi India", "start_time": "2013-04-26T18:00:00-0700", "id": "367331960042301"}, {"description": "About the meeting:\nEvery year, we take a moment (or an hour) to pause and reflect on the activities that were undertaken by AID Berkeley during the previous year. In this year's GBM, we will present the activities undertaken in 2012-- including fundraising, the types of projects that we supported and the awareness campaigns we were a part off. This exercise also helps us plan our activities for the year 2013. Apart from the learning exercise, it is our way of showcasing the work to our supporters in the community. You have all supported us in our fundraising efforts, contributed to the growth of the chapter and have been there encouraging us throughout. It is also our way of saying thanks.\n\nIt is not just all work....\nWe had a lot of fun in 2012 and continue doing so. The meeting will be informal and extremely participatory. So we have allowed ourselves enough time to mingle and get to know all our supporters. To make it extra special, our volunteers will be demonstrating their culinary skills, we will say no more :)\n\nBarrows is easily accessible from the intersection of Bancroft way and Telegraph Avenue and is an easy 15 min walk from the Downtown Berkeley BART station. Please see the attached map for more information.", "end_time": "2013-03-16T17:00:00-0700", "name": "AID 2013: Annual General Body Meeting", "start_time": "2013-03-16T15:00:00-0700", "id": "175224499292962"}, {"description": "AID Berkeley presents a free screening of Nero’s Guests, a compelling documentary about India’s agrarian crisis. \n\nSYNOPSIS\nOver the last decade in India, failing crops and insurmountable debt have driven nearly 200,000 farmers to commit suicide. \n\nDirector Deepa Bhatia uses the work of P Sainath, Rural Affairs Editor of The Hindu— one of India’s leading progressive newspapers— to highlight this agrarian crisis and the growing inequality in Indian society at large. Through sustained coverage of the farm crisis, Sainath and his colleagues forced the issue onto the collective national consciousness, and compelled a government in denial to take notice and act. Sainath’s work makes us confront the India we are reluctant to acknowledge, and provokes us to think about who ‘Nero’s Guests’ are in today’s world.\n\n‘Nero's Guests’ won the Indian Documentary Producers Association's Gold Medal for best documentary and several other awards in and outside India. \n\nFor more information about the event, email info@aidberkeley.org\n\nAbout AID Berkeley: \nThe Association for India's Development is a volunteer movement promoting sustainable, equitable and just development. AID supports grassroots organizations in India and initiates efforts in various interconnected spheres such as agriculture, education, health, livelihoods, natural resources, women's empowerment and social justice.\n\nThe Berkeley chapter of AID has been active since 2007, and currently supports projects in Gujarat, Maharashtra, and Tamil Nadu. For more information, visit: http://berkeley.aidindia.org/", "end_time": "2012-10-17T20:30:00-0700", "name": "Nero's Guests Film Screening", "start_time": "2012-10-17T19:00:00-0700", "id": "363957137017784"}, {"description": "Association for India's Development (AID) Berkeley presents \nRUN FOR INDIA (RFI) 2012\n\nAnnual Spring Half-Marathon Training Program\nSign up for the INFO SESSION here: http://berkeley.aidindia.org/rfi2012\n\nDate: Wednesday, April 18th 2012\nLocation: Wheeler 204, UC Berkeley Campus\nTime: 6:30 pm- 7:30 pm\n\nIf you are asking yourself\n* I have never walked or run before, how can I possibly think of running a half-marathon?\n* I am not sure of my running skills, is this too much to chew?\n\nDon’t worry! Just come to the information session and learn how YOU can train for a half-marathon! Please attend the below session to sign-up!\n\nHighlights:\n* Training is FREE and open to Public\n* Great coach with a lot of running experience\n* NO ENFORCED FUND RAISING GOAL\n* Limited slots Available! Runners would be accepted on a first come\nfirst policy\n* Snacks and Refreshments will be provided\n* Carpooling available for weekend runs. \n\n\nOur last information session :\nDate: Wednesday, April 18th 2012\nLocation: Wheeler 204, UC Berkeley Campus\nTime: 6:30 pm- 7:30 pm\n\n\nPrevious information session:\nInformation Session 1:\nDate: Tuesday, April 10th 2012\nLocation: Walnut Creek (Athletic Outpost, 1528 Bonanza Street, Walnut Creek CA 94596)  \nTime: 6:30 pm- 7:30 pm\n\nInformation Session 2:\nDate: Wednesday, April 18th 2012\nLocation: UC Berkeley Campus, Wheeler Hall, Room 204 \nTime: 6:30 pm- 7:30 pm \n\nSign up for the INFO SESSION here: http://berkeley.aidindia.org/rfi2012", "end_time": "2012-04-18T19:30:00-0700", "name": "Run for India 2012: Third Infosession", "start_time": "2012-04-18T18:30:00-0700", "id": "600774870024900"}, {"description": "Association for India's Development (AID) Berkeley, Center for\nSouth Asia Studies (CSAS) and Blum Center for Developing Economies present:\n\nWomen, Caste and Modern Science in India\nSpeaker: Abha Sur, Women’s and Gender Studies Program, MIT\n\nAbha Sur will discuss her recently published book Dispersed Radiance:\nCaste, Gender and Modern Science.  In it, through a series of micro\nhistories of physics, Abha Sur analyzes the confluence of caste,\nnationalism, and gender in modern science in India, and unpacks the\ncolonial context in which science was organized. The bulk of the book\nexamines the science and scientific practice of India s two preeminent\nphysicists in the first half of the twentieth century, C.V. Raman and\nMeghnad Saha. Raman and Saha were in terms of their social station,\npolitical involvement, and cultural upbringing diametric opposites.\nSur also reconstructs a collective history of Raman’s women students\nLalitha Chandrasekhar, Sunanda Bai, and Anna Mani each a scientist who\ndid not get her due.\n\n\nAbout Abha Sur's book:\n\"Dispersed Radiance makes an important contribution to the social\nhistory of science. It provides a nuanced and critical understanding\nof the role and location of science in the construction of Indian\nmodernity and in the continuation of social stratification in colonial\nand postcolonial contexts\" - Amazon\n\n\"... fascinating account of the play of caste and gender in science\nand in ‘scientific’ institutions in India …\" - The Hindu\n\nMore articles on her book:\nhttp://www.smartplanet.com/blog/global-observer/do-women-scientists-in-india-still-face-discrimination/2884?tag=search-river\nhttp://www.thehindu.com/arts/books/article2548119.ece\n\nAbout AID: http://berkeley.aidindia.org", "end_time": "2012-02-29T20:00:00-0800", "name": "Women, Caste and Modern Science in India: Abha Sur", "start_time": "2012-02-29T18:30:00-0800", "id": "948663248487942"}, {"description": "Please join us to listen to Tina Mann, a sensational upcoming Bay Area artist to support the Eureka Child Foundation, working to set up innovative village centers that ensure that children from the poorest families get a quality education.\n\nTina will be accompanied by Surinder Singh Mann (a disciple of the late Ustad Allah Rakha) and Gurdeep Singh Hira.\n\nTina will sing a selection of ghazals sung by Jagjit Singh, and written by Mirza Ghalib, Faiz Ahmad Faiz, Noor Jehan, and other including popular songs like Aj jane ki zid na karo, Dasht-e-Tanhaie, Mujse Pheli si and In Akhon Ki Masti Ke from Umrao Jaan. \n\nWe have Early Bird specials till Jan 6th 2012. Tickets start from $15 (for students and groups) and general admission is for $20.\n\nPlease buy tickets here: http://www.brownpapertickets.com/event/218008 or contact us directly for paper tickets.", "end_time": "2012-01-21T21:00:00-0800", "name": "Saaz: A Ghazal concert with Tina Mann", "start_time": "2012-01-21T19:00:00-0800", "id": "847933981987444"}]